# Assignment 1
```
Perform the following operations using R/Python on suitable data sets, 
- read data from different formats(like csv, xls),
- indexing and selecting data, sort data, describe attributes of data, checking data types of each column, counting unique values of data, format of each column, converting variable data type (e.g. from long to short, vice versa), identifying missing values and fill in the missing values
```

In [2]:
from pandas import read_csv

In [3]:
data_frame = read_csv('salary_data.csv')
data_frame.dtypes

timestamp                   object
company                     object
level                       object
title                       object
totalyearlycompensation      int64
location                    object
yearsofexperience          float64
yearsatcompany             float64
tag                         object
basesalary                 float64
stockgrantvalue            float64
bonus                      float64
gender                      object
otherdetails                object
cityid                       int64
dmaid                      float64
rowNumber                    int64
Masters_Degree               int64
Bachelors_Degree             int64
Doctorate_Degree             int64
Highschool                   int64
Some_College                 int64
Race_Asian                   int64
Race_White                   int64
Race_Two_Or_More             int64
Race_Black                   int64
Race_Hispanic                int64
Race                        object
Education                   object
dtype: object

In [4]:
print(f"Shape of dataset rows = {data_frame.shape[0]}, attributes = {data_frame.shape[1]}")

Shape of dataset rows = 62642, attributes = 29

In [5]:
data_frame.head

<bound method NDFrame.head of                 timestamp     company     level                         title  \
0       6/7/2017 11:33:27      Oracle        L3               Product Manager
1      6/10/2017 17:11:29        eBay      SE 2             Software Engineer
2      6/11/2017 14:53:57      Amazon        L7               Product Manager
3       6/17/2017 0:23:14       Apple        M1  Software Engineering Manager
4      6/20/2017 10:58:51   Microsoft        60             Software Engineer
...                   ...         ...       ...                           ...
62637   9/9/2018 11:52:32      Google        T4             Software Engineer
62638   9/13/2018 8:23:32   Microsoft        62             Software Engineer
62639  9/13/2018 14:35:59        MSFT        63             Software Engineer
62640  9/16/2018 16:10:35  Salesforce  Lead MTS             Software Engineer
62641   1/29/2019 5:12:59       apple      ict3             Software Engineer

       totalyearlycompensation           location  yearsofexperience  \
0                       127000   Redwood City, CA                1.5
1                       100000  San Francisco, CA                5.0
2                       310000        Seattle, WA                8.0
3                       372000      Sunnyvale, CA                7.0
4                       157000  Mountain View, CA                5.0
...                        ...                ...                ...
62637                   327000        Seattle, WA               10.0
62638                   237000        Redmond, WA                2.0
62639                   220000        Seattle, WA               14.0
62640                   280000  San Francisco, CA                8.0
62641                   200000      Sunnyvale, CA                0.0

       yearsatcompany                             tag  basesalary  ...  \
0                 1.5                             NaN    107000.0  ...
1                 3.0                             NaN         0.0  ...
2                 0.0                             NaN    155000.0  ...
3                 5.0                             NaN    157000.0  ...
4                 3.0                             NaN         0.0  ...
...               ...                             ...         ...  ...
62637             1.0  Distributed Systems (Back-End)    155000.0  ...
62638             2.0                      Full Stack    146900.0  ...
62639            12.0                      Full Stack    157000.0  ...
62640             4.0                             iOS    194688.0  ...
62641             0.0                         ML / AI    155000.0  ...

       Doctorate_Degree  Highschool Some_College Race_Asian  Race_White  \
0                     0           0            0          0           0
1                     0           0            0          0           0
2                     0           0            0          0           0
3                     0           0            0          0           0
4                     0           0            0          0           0
...                 ...         ...          ...        ...         ...
62637                 0           0            0          0           0
62638                 0           0            0          0           0
62639                 0           0            0          0           0
62640                 0           0            0          0           0
62641                 0           0            0          0           0

       Race_Two_Or_More  Race_Black  Race_Hispanic  Race  Education
0                     0           0              0   NaN        NaN
1                     0           0              0   NaN        NaN
2                     0           0              0   NaN        NaN
3                     0           0              0   NaN        NaN
4                     0           0              0   NaN        NaN
...                 ...         ...            ...   ...        ...
62637                 0           0              0   NaN        NaN
62638                 0           0              0   NaN        NaN
62639                 0           0              0   NaN        NaN
62640                 0           0              0   NaN        NaN
62641                 0           0              0   NaN        NaN

[62642 rows x 29 columns]>

In [6]:
# accesing rows
data_frame.iloc[10]

timestamp                            6/30/2017 16:29:50
company                                      Salesforce
level                                                 9
title                      Software Engineering Manager
totalyearlycompensation                          450000
location                              San Francisco, CA
yearsofexperience                                  16.0
yearsatcompany                                      3.0
tag                                                 NaN
basesalary                                     230000.0
stockgrantvalue                                100000.0
bonus                                           45000.0
gender                                              NaN
otherdetails                                        NaN
cityid                                             7419
dmaid                                             807.0
rowNumber                                            18
Masters_Degree                                        0
Bachelors_Degree                                      0
Doctorate_Degree                                      0
Highschool                                            0
Some_College                                          0
Race_Asian                                            0
Race_White                                            0
Race_Two_Or_More                                      0
Race_Black                                            0
Race_Hispanic                                         0
Race                                                NaN
Education                                           NaN
Name: 10, dtype: object

In [7]:
# accesing field of row
data_frame.iloc[3]["title"]

'Software Engineering Manager'

In [8]:
# accesing multiple fields of row
data_frame.iloc[3][["title", "location", "basesalary"]]

title         Software Engineering Manager
location                     Sunnyvale, CA
basesalary                        157000.0
Name: 3, dtype: object

In [9]:
# accesing multiple fields of row
data_frame.iloc[3][["title", "location", "basesalary"]]

title         Software Engineering Manager
location                     Sunnyvale, CA
basesalary                        157000.0
Name: 3, dtype: object

In [10]:
# accesing particular column
data_frame["location"]

0         Redwood City, CA
1        San Francisco, CA
2              Seattle, WA
3            Sunnyvale, CA
4        Mountain View, CA
               ...
62637          Seattle, WA
62638          Redmond, WA
62639          Seattle, WA
62640    San Francisco, CA
62641        Sunnyvale, CA
Name: location, Length: 62642, dtype: object

In [11]:
# accesing multiple columns
data_frame[["location", "basesalary"]]

                location  basesalary
0       Redwood City, CA    107000.0
1      San Francisco, CA         0.0
2            Seattle, WA    155000.0
3          Sunnyvale, CA    157000.0
4      Mountain View, CA         0.0
...                  ...         ...
62637        Seattle, WA    155000.0
62638        Redmond, WA    146900.0
62639        Seattle, WA    157000.0
62640  San Francisco, CA    194688.0
62641      Sunnyvale, CA    155000.0

[62642 rows x 2 columns]

In [12]:
# print different job titles in the datasets
data_frame["title"].value_counts()

Software Engineer               41231
Product Manager                  4673
Software Engineering Manager     3569
Data Scientist                   2578
Hardware Engineer                2200
Product Designer                 1516
Technical Program Manager        1381
Solution Architect               1157
Management Consultant             976
Business Analyst                  885
Marketing                         710
Mechanical Engineer               490
Sales                             461
Recruiter                         451
Human Resources                   364
Name: title, dtype: int64

In [13]:
data_frame["company"].value_counts()

Amazon                      8126
Microsoft                   5216
Google                      4330
Facebook                    2990
Apple                       2028
                            ...
Samsung research America       1
Bny Mellon                     1
yelp                           1
Bloomberg lp                   1
tableau software               1
Name: company, Length: 1631, dtype: int64

In [14]:
data_frame = data_frame.sort_values("basesalary",ascending=False)

In [15]:
data_frame["basesalary"].value_counts()

160000.0     2806
0.0          2304
150000.0     2265
130000.0     1721
140000.0     1684
             ...
126500.0        1
126200.0        1
125500.0        1
124762.0        1
1659870.0       1
Name: basesalary, Length: 482, dtype: int64

In [16]:
data_frame[["company", "title", "basesalary", "totalyearlycompensation","yearsofexperience"]]

,company,title,basesalary,totalyearlycompensation,yearsofexperience
62351,Microsoft,Product Manager,1659870.0,250000,13.0
61851,Squarespace,Software Engineer,1620000.0,162000,7.0
45054,PwC,Management Consultant,900000.0,900000,22.0
56175,Netflix,Software Engineer,893000.0,893000,19.0
57701,Netflix,Software Engineer,861000.0,861000,15.0
...,...,...,...,...,...
4179,IBM,Software Engineer,0.0,120000,0.0
4176,Goldman Sachs,Software Engineering Manager,0.0,285000,10.0
9155,Cisco,Software Engineer,0.0,100000,5.0
9161,Veritas Technologies,Solution Architect,0.0,180000,15.0
3762,Amazon,Product Designer,0.0,418000,14.0

In [17]:
data_frame["basesalary"].describe()

count    6.264200e+04
mean     1.366873e+05
std      6.136928e+04
min      0.000000e+00
25%      1.080000e+05
50%      1.400000e+05
75%      1.700000e+05
max      1.659870e+06
Name: basesalary, dtype: float64

In [18]:
data_frame.query('basesalary >= 200000')[["company", "title", "basesalary", "Race"]]

           company                         title  basesalary   Race
62351    Microsoft               Product Manager   1659870.0    NaN
61851  Squarespace             Software Engineer   1620000.0    NaN
45054          PwC         Management Consultant    900000.0  Asian
56175      Netflix             Software Engineer    893000.0  White
57701      Netflix             Software Engineer    861000.0  White
...            ...                           ...         ...    ...
54268        Yahoo             Software Engineer    200000.0  White
55562       Gopuff  Software Engineering Manager    200000.0  White
37891       Google             Software Engineer    200000.0    NaN
30367       Google              Product Designer    200000.0    NaN
23994       PayPal  Software Engineering Manager    200000.0  White

[7088 rows x 4 columns]

In [19]:
data_frame["location"].value_counts()

Seattle, WA                  8701
San Francisco, CA            6797
New York, NY                 4562
Redmond, WA                  2649
Mountain View, CA            2275
                             ...
Pascagoula, MS                  1
Rio Rancho, NM                  1
Monroe, LA, United States       1
Fort Myers, FL                  1
Beverly, MA                     1
Name: location, Length: 1050, dtype: int64